data/Parm_PH_29/alpha_10/alpha_10_12000_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0525328740872448 1.00078683887884 0)
(0.157588686473411 0.997265491588046 -2.13746114750967e-18)
(0.261244685041756 0.981175430075215 0)
(0.359624143724796 0.945355339219569 -1.48747331007469e-17)
(0.450258445773575 0.892547060376582 1.43108082959323e-17)
(0.534802248621494 0.830356085114776 0)
(0.61594759597138 0.763832815322179 1.6989636550596e-17)
(0.695897426313365 0.695917986765067 1.05117182405246e-17)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.052538030828719 1.00000464668192 0)
(0.157457571708034 0.996486198086277 0)
(0.260766568121779 0.980477179616037 0)
(0.358787033942751 0.944883603991789 0)
(0.449287647149667 0.892212689628735 0)
(0.533836442603869 0.829981273796805 0)
(0.615028617538822 0.76330798618755 0)
(0.695033381245503 0.695183993266097 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.05 2.024 0)
(0.15 2.024 0)
(0.25 2.024 0)
(0.35 2.024 0)
(0.45 2.024 0)
(0.55 2.024 0)
(0.65 2.024 0)
(0.75 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
