data/Parm_PH_29/alpha_10/alpha_10_12000_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00927599 -0.00014016 0.00000000 0.00004475 0.00000000 0.00548185)
(0.00912120 0.00000598 0.00000000 -0.00004660 0.00000000 0.00532570)
(0.00257979 -0.00032319 0.00000000 0.00060696 0.00000000 0.00827087)
(-0.00019291 -0.00063872 0.00000000 0.00043274 0.00000000 0.00474767)
(0.00238455 -0.00191577 0.00000000 0.00134531 0.00000000 0.00316554)
(0.00469167 -0.00363197 0.00000000 0.00279838 0.00000000 0.00602695)
(0.00137462 -0.00104760 0.00000000 0.00077939 0.00000000 0.00178983)
(0.00139694 -0.00105060 0.00000000 0.00079703 0.00000000 0.00196765)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
